// Author: Ryan Jordan - NowIntel
// Date: 18/10/23 
// Website: nowintel.substack.com
// CISA advisory: https://www.cisa.gov/news-events/cybersecurity-advisories/aa23-284a
let email_address = dynamic(["keishagrey994@outlook.com"]);
let filehash = dynamic(["829f2233a1cd77e9ec7de98596cd8165", "6ebd7d7473f0ace3f52c483389cab93f", "10ef090d2f4c8001faadb0a833d60089", "8227af68552198a2d42de51cded2ce60", "9d0b3796d1d174080cdfdbd4064bea3a", "af31b5a572b3208f81dbf42f6c143f99", "1892bd45671f17e9f7f63d3ed15e348e", "cc68eaf36cb90c08308ad0ca3abc17c1", "646dc0b7335cffb671ae3dfd1ebefe47", "609a925fd253e82c80262bad31637f19", "c6a667619fff6cf44f447868d8edd681", "3222c60b10e5a7c3158fd1cb3f513640", "90ce10d9aca909a8d2524bc265ef2fa4", "44a3561fb9e877a2841de36a3698abc0", "5cb3f10db11e1795c49ec6273c52b5f1", "122ea6581a36f14ab5ab65475370107e", "c82d7be7afdc9f3a0e474f019fb7b0f7"]);
let filename = dynamic([
    "psscriptpolicytest_im2hdxqi.g0k.ps1",
    "psscriptpolicytest_lysyd03n.o10.ps1",
    "psscriptpolicytest_1bokrh3l.2nw.ps1",
    "psscriptpolicytest_nvuxllhd.fs4.ps1",
    "psscriptpolicytest_2by2p21u.4ej.ps1",
    "psscriptpolicytest_te5sbsfv.new.ps1",
    "psscriptpolicytest_v3etgbxw.bmm.ps1",
    "psscriptpolicytest_fqa24ixq.dtc.ps1",
    "psscriptpolicytest_jzjombgn.sol.ps1",
    "psscriptpolicytest_rdm5qyy1.phg.ps1",
    "psscriptpolicytest_endvm2zz.qlp.ps1",
    "psscriptpolicytest_s1mgcgdk.25n.ps1",
    "psscriptpolicytest_xnjvzu5o.fta.ps1",
    "psscriptpolicytest_satzbifj.oli.ps1",
    "psscriptpolicytest_grjck50v.nyg.ps1",
    "psscriptpolicytest_0bybivfe.x1t.ps1",
    "NetMonitor.exe",
    "psscriptpolicytest_bzoicrns.kat.ps1"
]);
DeviceProcessEvents | join kind=inner DeviceNetworkEvents on DeviceId, InitiatingProcessId, InitiatingProcessCreationTime | where FileName in (filename) or SHA256 in (filehash) or MD5 in (filehash) or SHA1 in (filehash) or email_address has_any (email_address) // Project the relevant columns and sort by timestamp | project TimeGenerated, DeviceName, FileName, SHA256, InitiatingProcessCommandLine, registry_keys as RegistryKey, RemoteUrl | sort by TimeGenerated desc

