// Author: Ryan Jordan - NowIntel
// Date: 01/06/23 

// Query for file names
DeviceFileEvents
| where FileName in ("document.exe", "edputil.dll")
| project FileName, DeviceId
| union (
    // Query for executable paths
    DeviceProcessEvents
    | where InitiatingProcessFileName in ("curl.exe", "rundll32.exe")
    | project InitiatingProcessFileName, DeviceId
)
| union (
    // Query for command
    DeviceProcessEvents
    | where ProcessCommandLine == "rundll32 c:\\users\\public\\default.png,print"
    | project ProcessCommandLine, DeviceId
)
